/**
 *****************************************
 * Created by lifx
 * Created on 2017-11-27 15:21:01
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 自定义文件转换器
 *****************************************
 */
export function process(args: string[]): string {
  return `module.exports = ${ JSON.stringify(args[1]) };`;
}


/**
 *****************************************
 * 抛出接口
 *****************************************
 */
export default { process };
