/**
 *****************************************
 * Created by lifx
 * Created on 2018-04-05 13:37:26
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 自定义【html】转换器
 *****************************************
 */
export function process(code: string): string {
  return `module.exports = ${ JSON.stringify(code) };`;
}


/**
 *****************************************
 * 抛出接口
 *****************************************
 */
export default { process };
