/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2022-12-11 19:33:02
 *****************************************
 */
'use strict';

/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import { Config } from 'jest';
import { config } from './config';


/**
 *****************************************
 * 可等待对象
 *****************************************
 */
type Awaitable<T> = T | Promise<T>;


/**
 *****************************************
 * 定义配置
 *****************************************
 */
export function defineConfig(handler?: (config: Config) => Awaitable<void | Config>): () => Awaitable<Config> {
  return () => {
    return (handler && handler(config) || config) as Awaitable<Config>;
  };
}


/**
 *****************************************
 * 导出配置
 *****************************************
 */
export { config };


/**
 *****************************************
 * 导出默认配置
 *****************************************
 */
export default config;
